akinakano/RP2040_battery_control/CM7/App/Src/comm_mpsv.c
#include <stm32h747xx.h>
#include "comm_mpsv.h"
#include "sci.h"
#include "GPIO.h"
#include "motion_controller.h"

#define USART_ICR_ALL ( USART_ICR_PECF | USART_ICR_FECF | USART_ICR_NECF | USART_ICR_ORECF | USART_ICR_IDLECF\
                        | USART_ICR_TXFECF | USART_ICR_TCCF | USART_ICR_TCBGTCF | USART_ICR_LBDCF | USART_ICR_CTSCF \
                        | USART_ICR_RTOCF | USART_ICR_EOBCF | USART_ICR_UDRCF | USART_ICR_CMCF | USART_ICR_WUCF )


//#define MP_COMM_IrqHandler      (UART4_IRQHandler)   // 割込みハンドラの読み替え
#define MP_COMM_SOFT_IrqHandler (EXTI0_IRQHandler)    // 割込みハンドラの読み替え
// #define MP_COMM_UART_IRQn       (USART1_IRQn)
#define UART_RX_BUF_SIZE        (4096)

SV_Comm_t sv_data[COMM_SV_NUM];

/***********************
  プライベート変数
***********************/
static uint8_t uart_rx_buf[UART_RX_BUF_SIZE] = {0};
Queue comm_receive_queue = {0};
static USART_error_count usart_error_count = {0};
static uint8_t _mp_sv_current_write = 0;
static uint8_t _mp_sv_current_read = 1;
static COM_MP_TO_SV _mp_sv_mode;
static COM_MP_TO_SV _mp_sv_cmd;
static COM_SV_TO_MP _sv_mp;
static uint8_t _com_st_current_write = 0;
static uint8_t _com_st_current_read = 1;
static COM_STATUS _com_st[2];   // double buffer
static STATE_MACHINE state_mcn;

/***********************
  プロトタイプ宣言
***********************/
void init_queue( Queue* _q, uint8_t* _buf, uint32_t _size );
//static void init_receive_parser_buff(COM_MP_TO_SV * mp_sv);
static void init_receive_parser_buff_multi(COM_STATUS * com_st);
static uint8_t calc_crc(uint8_t *ptr, uint8_t len);
void parser(COM_MP_TO_SV * mp_sv, COM_SV_TO_MP * sv_mp);
void set_send_status_data(COM_SV_TO_MP * sv_mp, COM_STATUS* com_st);
void send_status( COM_SV_TO_MP * sv_mp );

/***********************
  関数
***********************/
void comm_parser_Init( void )
{
    init_queue( &comm_receive_queue, uart_rx_buf, UART_RX_BUF_SIZE );
    init_receive_parser_buff_multi( &_com_st[0]);
    init_receive_parser_buff_multi( &_com_st[1]);
    _mp_sv_current_write = 0;
    _mp_sv_current_read = 1;
    _com_st_current_write = 0;
    _com_st_current_read = 1;
    state_mcn.status = MP_TO_SV;
    state_mcn.err_info_cnt = 0;
}

void init_queue( Queue* _q, uint8_t* _buf, uint32_t _size )
{
    if ( _q ) {
        _q->buf = _buf;
        _q->size = _size;
        _q->head = 0;
        _q->tail = 0;
    }
}

static void init_receive_parser_buff_multi(COM_STATUS * com_st)
{
    for (int i = 0; i < COMMAND_SIZE_MAX; i++) {
        com_st->buff[i] = 0x00;
    }
    com_st->direction = MP_TO_SV;
    com_st->command = 0x00;
    com_st->tar_id = 0x00;
    com_st->dest = 0x00;
    com_st->packet_len = 0x00;
    com_st->req_status = 0x00;
    for (int i = 0; i < MAX_SERVO_NUM; i++) {
        com_st->param_mode[i] = 0x00;
        com_st->force[i] = 0x0000;
        com_st->pos[i] = 0x0000;
    }

    com_st->status_id = 0x00;
    com_st->sending_sv_id = 0x00;
    com_st->reqed_status = 0x00;
    com_st->source_current = 0x0000;
    com_st->pos_hall = 0x0000;
    com_st->pos_mr = 0x0000;
    com_st->primary_status = 0x0000;
    com_st->reqed_status_value = 0x0000;

    com_st->crc = 0x00;
    com_st->crc_err = 0x00;
    com_st->receive_status = NO_RECEIVING;
    com_st->received_byte_num = 0;
}

inline static uint8_t is_usart_isr_error_detected( uint32_t isr )
{
    return ( ( isr & ( USART_ISR_ORE | USART_ISR_NE | USART_ISR_FE | USART_ISR_PE ) ) != 0 );
}

inline static uint8_t is_usart_isr_rx_empty( uint32_t isr )
{
    uint8_t ret = 0;
    uint32_t temp = isr & USART_ISR_RXNE_RXFNE;
    if (temp == USART_ISR_RXNE_RXFNE) {     //RXNEフラグが立っているのでRXは空ではないのでゼロ
        ret = 0;
    } else {            // RXNEフラグが立ってないのでRX空なので1を返す
        ret = 1;
    }
    return ret;
}

inline static uint8_t is_usart_txFIFO_full( uint32_t isr )
{
    uint8_t ret = 0;
    uint32_t temp = isr & USART_ISR_TXE_TXFNF;  // TXFNF:TXFIFOノットフル. 1ならばフルではないのでTDRに書き込める
    if (temp == USART_ISR_TXE_TXFNF) {     //TXNEフラグが立っているのでTXは空ではないのでゼロ
        ret = 0;
    } else {            // TXNEフラグが立ってないのでRX空なので1を返す
        ret = 1;
    }
    return ret;
}

uint8_t is_transmit_completed( uint32_t isr )
{
    return ((isr & USART_ISR_TC) != 0);
}

uint8_t is_queue_empty( const Queue* _q )
{
    return (_q->head == _q->tail);
}

uint8_t is_queue_full( const Queue* _q )
{
    uint8_t is_full = 0;
    // tailの次がheadだったらfullと判定。ただしtailがキューの最後だったら0に戻す。
    uint16_t temp_next_tail = _q->tail + 1;
    if (temp_next_tail == _q->size) {
        temp_next_tail = 0;
    }
    if (temp_next_tail == _q->head) {
        is_full = 1;
    } else {
        is_full = 0;
    }
    return is_full;
}

uint8_t enqueue_no_overwrite( Queue* _q, uint8_t val )
{
    // キューがいっぱいで無ければキューに格納。いっぱいの時は破棄。
    if ( !is_queue_full(_q) ) {
        _q->buf[_q->tail] = val;
        // tailを更新する。キューサイズを超えたら0も戻す。(リングバッファ)
        _q->tail++;
        if (_q->tail == _q->size) {
            _q->tail = 0;
        }
        return 1;
    }
    return 0;
}

uint8_t dequeue( Queue* _q, uint8_t* val )
{
    if ( val && !is_queue_empty(_q) ) {
        *val = _q->buf[_q->head];
        // headを更新する。キューサイズを超えたら0も戻す。(リングバッファ)
        _q->head++;
        if (_q->head == _q->size) {
            _q->head = 0;
        }
        return 1;
    }
    return 0;
}

static void USARTx_ISR_error_detected( uint32_t error_register )
{
    USART_TypeDef *UARTx = SCI_COMM_UART;
    if (error_register & USART_ISR_FE) {
        usart_error_count.framing_error++;
    }
    if (error_register & USART_ISR_PE) {
        usart_error_count.parity_error++;
    }
    if (error_register & USART_ISR_ORE) {
        usart_error_count.overrun_error++;

        // Receive control disable
        NVIC_DisableIRQ(MP_COMM_UART_IRQn);
        UARTx->CR1 &= (~USART_CR1_RE);      // Receive disable

        // Receive FIFO clear ( RFCLR )
        UARTx->RQR |= USART_RQR_RXFRQ;

        // 割り込みフラグをクリアする
        UARTx->ICR |= USART_ICR_ALL;

        // Receive control enable
        UARTx->CR1 |= USART_CR1_RE;    // Receive enable

        uint16_t timeout_count = 0;
        const uint16_t TIMEOUT_COUNT_MAX = 100;
        while (0 == (( UARTx->ISR ) & USART_ISR_REACK)) {  // RE wait
            if ( timeout_count++ >= TIMEOUT_COUNT_MAX ) {
                break;
            }
        }
        NVIC_EnableIRQ(MP_COMM_UART_IRQn);
    }
    usart_error_count.is_error = 1;
}

/********************************************************
  上流通信のUARTのRX FIFOにデータが入るとかかる割り込み処理
********************************************************/
void MP_COMM_IrqHandler(void)
{
    USART_TypeDef *UARTx = SCI_COMM_UART;

    uint32_t isr = 0;
    uint8_t is_received = 0;
    uint8_t is_error = 0;
    uint32_t timeout_count = 0;
    const uint32_t TIMEOUT_COUNT_MAX = 1000;

    while ( timeout_count++ < TIMEOUT_COUNT_MAX ) {
        isr = UARTx->ISR;

        // 割り込みフラグをクリアする
        UARTx->ICR |= USART_ICR_ALL;

