akinakano/RP2040_battery_control/CM7/App/Src/comm_mpsv.c
        if ( (is_error = is_usart_isr_error_detected(isr)) ) {
            break;
        }

        //RXの受信が無い(RXNEフラグが立っていない)ならば抜ける
        if ( is_usart_isr_rx_empty(isr) ) {
            break;
        }
        //RXに受信しているのでキューに積む
        enqueue_no_overwrite( &comm_receive_queue, (uint8_t)(UARTx->RDR & 0xff) );//読めてない？
        UARTx->RQR |= USART_RQR_TXFRQ;
        is_received = 1;
    }
    // error detected
    if ( is_error ) {
        USARTx_ISR_error_detected( isr );
    }
    if ( is_received ) {
        // 拡張割り込みコントローラー(EXTI)でソフト割り込みを発生させる
        EXTI->SWIER1 |= EXTI_SWIER1_SWIER0;
    }
}


inline static PACKET_RECEIVE_STATUS next_receive_status_multi( const COM_STATUS* com_st )
{
    if ( com_st->crc_err ) {
        return RECEIVE_FAILED;
    }
    PACKET_RECEIVE_STATUS current_status = com_st->receive_status;
    switch ( current_status ) {
        case NO_RECEIVING:
            if ( com_st->received_byte_num > 0 ) {
                return HEADER_RECEIVING;
            }
            return current_status;
        case HEADER_RECEIVING:
            if ( com_st->received_byte_num > HEADER_SIZE ) {
                return BODY_RECEIVING;
            }
            return current_status;
        case BODY_RECEIVING:
            if ( com_st->received_byte_num >= com_st->packet_len ) {
                return RECEIVE_COMPLETED;
            }
            return current_status;
        case RECEIVE_COMPLETED:
            return current_status;
        case RECEIVE_ABORTED:
            return current_status;
        case RECEIVE_FAILED:
            if ( com_st->received_byte_num > 0 ) {
                // try header receive again
                return HEADER_RECEIVING;
            }
            return current_status;
        default:
            return current_status;
    }
}

inline static PACKET_RECEIVE_STATUS receive_byte_multi( COM_STATUS* com_st )
{
    if ( (com_st->receive_status == RECEIVE_COMPLETED) || (com_st->receive_status == RECEIVE_ABORTED) || (com_st->receive_status == RECEIVE_FAILED) ) {
        // reset
        init_receive_parser_buff_multi( com_st );
    }

    com_st->received_byte_num += dequeue( &comm_receive_queue, &com_st->buff[com_st->received_byte_num] );
    return ( com_st->receive_status = next_receive_status_multi( com_st ) );
}

COM_MP_TO_SV * get_send_mode_handle()
{
    return &_mp_sv_mode;
}

COM_MP_TO_SV * get_send_cmd_handle()
{
    return &_mp_sv_cmd;
}

COM_SV_TO_MP * get_status_handle()
{
    return &_sv_mp;
}

COM_STATUS * get_com_status_handle()
{
    return &_com_st[_com_st_current_read];
}

COM_STATUS * get_com_status_ura_handle()
{
    if (_com_st_current_read == 0) {
        return &_com_st[1];
    } else {
        return &_com_st[0];
    }
}

STATE_MACHINE * get_com_state_machine()
{
    return &state_mcn;
}

inline static void check_command_id( COM_MP_TO_SV* mp_sv )
{
    if (   mp_sv->command != MODE_CHANGE_ALL
        && mp_sv->command != MODE_CHANGE_TID
        && mp_sv->command != FORCE_CNTRL_ALL
        && mp_sv->command != FORCE_CNTRL_TID
        && mp_sv->command != ACC_CNTRL_ALL
        && mp_sv->command != ACC_CNTRL_TID
        && mp_sv->command != POS_CNTRL_ALL
        && mp_sv->command != POS_CNTRL_TID ) {
        // command id が不正なので受信abort
        mp_sv->receive_status = RECEIVE_ABORTED;
    }
}

inline static void parse_command_header( COM_MP_TO_SV* mp_sv )
{
    if ( mp_sv->received_byte_num == HEADER_COMMAND_ID + 1 ) {
        mp_sv->command = mp_sv->buff[HEADER_COMMAND_ID];
        check_command_id( mp_sv );
    }
    else if ( mp_sv->received_byte_num == HEADER_TARGET_ID + 1 ) {
        mp_sv->tar_id = mp_sv->buff[HEADER_TARGET_ID];
        // TODO: この時点で、tar_idが自分と違う場合はreceive_statusを"SKIP"とかに設定して
        //       以後の受信はpacket_len分飛ばす、という特殊処理に分岐できると良い
    }
    else if ( mp_sv->received_byte_num == HEADER_PACKET_LEN + 1 ) {
        mp_sv->packet_len = mp_sv->buff[HEADER_PACKET_LEN];
    }
    else if ( mp_sv->received_byte_num == HEADER_REQ_STATUS + 1 ) {
        mp_sv->req_status = mp_sv->buff[HEADER_REQ_STATUS];
    }
    else {
        // all header should be received and parsed
        return;
    }
}

void check_com_direction( COM_STATUS* com_st )
{
    uint8_t _data = com_st->buff[HEADER_COMMAND_ID];
    if ( _data == SV_STATUS_ID ) {
        com_st->direction = SV_TO_MP;
        com_st->status_id = _data;
    } else if (_data == MODE_CHANGE_ALL
            || _data == MODE_CHANGE_TID
            || _data == FORCE_CNTRL_ALL
            || _data == FORCE_CNTRL_TID
            || _data == ACC_CNTRL_ALL
            || _data == ACC_CNTRL_TID
            || _data == POS_CNTRL_ALL
            || _data == POS_CNTRL_TID ) {
        com_st->direction = MP_TO_SV;
        com_st->command = _data;
    } else {
        // command id が不正なので受信abort
        com_st->receive_status = RECEIVE_ABORTED;
    }
}

inline static void parse_command_header_multi( COM_STATUS* com_st )
{
    if ( com_st->received_byte_num == HEADER_COMMAND_ID + 1 ) {
        check_com_direction(com_st);
    }
    else if ( com_st->received_byte_num == HEADER_TARGET_ID + 1 ) {
        if ( com_st->direction == MP_TO_SV ) {
            com_st->tar_id = com_st->buff[HEADER_TARGET_ID];
            if (com_st->tar_id == BROAD) {
                com_st->dest = BROAD;
            } else {
                com_st->dest = UNI;
            }
        // TODO: この時点で、tar_idが自分と違う場合はreceive_statusを"SKIP"とかに設定して
        //       以後の受信はpacket_len分飛ばす、という特殊処理に分岐できると良い
        } else {
            com_st->sending_sv_id = com_st->buff[HEADER_MY_SV_ID];
        }
    }
    else if ( com_st->received_byte_num == HEADER_PACKET_LEN + 1 ) {
        com_st->packet_len = com_st->buff[HEADER_PACKET_LEN];
    }
    else if ( com_st->received_byte_num == HEADER_REQ_STATUS + 1 ) {
        if ( com_st->direction == MP_TO_SV ) {
            com_st->req_status = com_st->buff[HEADER_REQ_STATUS];
        } else {
            com_st->reqed_status = com_st->buff[HEADER_REQUESTED_STATUS];
        }
    }
    else {
        // all header should be received and parsed
        return;
    }
}

inline static void parse_2byte_param( const uint8_t* raw, int16_t* parsed, uint8_t raw_idx )
{
    if ( ((raw_idx-HEADER_SIZE) & 1) == 0 ) {
        // even number -> should be higher byte, received former
        *parsed = (int16_t)((uint16_t)(raw[raw_idx] << 8));
    }
    else {
        // odd number -> should be lower byte, received later
        *parsed = (int16_t)((uint16_t)*parsed | (uint16_t)raw[raw_idx]);
    }
}

inline static void parse_command_body_multi( COM_STATUS* com_st )
{
    if ( com_st->received_byte_num >= com_st->packet_len ) {
        // all body (except CRC) shoud be received and parsed
        return;
    }

    // TODO: tar_idが自分と違う場合はpacket_len分読み飛ばせるようにしたい

