akinakano/RP2040_battery_control/CM7/App/Src/comm_mpsv.c
    if ( com_st->received_byte_num <= HEADER_SIZE ) {
        // no body byte comming yet
        return;
    }

    uint8_t param_byte_idx = com_st->received_byte_num-1;

    if ( com_st->direction == MP_TO_SV ) {
        switch ( com_st->command ) {
            case MODE_CHANGE_ALL:
            case MODE_CHANGE_TID:
                com_st->param_mode[(param_byte_idx-HEADER_SIZE)] = com_st->buff[param_byte_idx];
                break;
            case FORCE_CNTRL_ALL:
            case FORCE_CNTRL_TID:
                {   // C言語ではswitch文の中で変数宣言を行うとエラーになる。対策として{}で括る
                    // 2byte毎にidxを進めたい。param_byte_idxが4,5のとき0   6,7のとき1  8,9のとき2
                    uint8_t idx = (param_byte_idx - HEADER_SIZE) >> 1;
                    parse_2byte_param( com_st->buff, com_st->force + idx, param_byte_idx );
                }
                break;
            case ACC_CNTRL_ALL:
            case ACC_CNTRL_TID:
                {   // C言語ではswitch文の中で変数宣言を行うとエラーになる。対策として{}で括る
                    // 2byte毎にidxを進めたい。param_byte_idxが4,5のとき0   6,7のとき1  8,9のとき2
                    uint8_t idx = (param_byte_idx - HEADER_SIZE) >> 1;
                    parse_2byte_param( com_st->buff, com_st->force + idx, param_byte_idx );
                }
                break;
            case POS_CNTRL_ALL:
            case POS_CNTRL_TID:
                {
                    uint8_t idx = (param_byte_idx - HEADER_SIZE) >> 1;
                    parse_2byte_param( com_st->buff, com_st->pos + idx, param_byte_idx );
                }
                break;
            default:
                com_st->receive_status = RECEIVE_FAILED;
                break;
        }
    } else if ( com_st->direction == SV_TO_MP ) {
        switch( param_byte_idx ) {
            case BODY_SOURCE_CURRENT:
                com_st->source_current = com_st->buff[param_byte_idx];
                break;
            case BODY_IQ_CURRENT_L:
            case BODY_IQ_CURRENT_H:
                //parse_2byte_param( com_st->buff, &com_st->iq_current, param_byte_idx);
                com_st->iq_current = (int16_t)(com_st->buff[param_byte_idx] + (uint16_t)(com_st->buff[BODY_IQ_CURRENT_L] <<8));//HL逆?
                break;
            case BODY_POS_HALL_L:
            case BODY_POS_HALL_H:
                //parse_2byte_param( com_st->buff, &com_st->pos_hall, param_byte_idx);
                com_st->pos_hall = (int16_t)(com_st->buff[param_byte_idx] + (uint16_t)(com_st->buff[BODY_POS_HALL_L] << 8));//HL逆?
                break;
            case BODY_POS_MR_L:
            case BODY_POS_MR_H:
                //parse_2byte_param( com_st->buff, &com_st->pos_mr, param_byte_idx);
                com_st->pos_mr = (int16_t)(com_st->buff[param_byte_idx] + (uint16_t)(com_st->buff[BODY_POS_MR_L] << 8));//HL逆?
                break;
            case BODY_PRIMARY_STATUS_L:
            case BODY_PRIMARY_STATUS_H:
                //parse_2byte_param( com_st->buff, &com_st->primary_status, param_byte_idx);
                com_st->primary_status= (int16_t)(com_st->buff[param_byte_idx] + (uint16_t)(com_st->buff[BODY_PRIMARY_STATUS_L] << 8));//HL逆?
                break;
            case BODY_REQED_STATUS_VALUE_L:
            case BODY_REQED_STATUS_VALUE_H:
                //parse_2byte_param( com_st->buff, &com_st->reqed_status_value, param_byte_idx);
                com_st->reqed_status_value = (int16_t)(com_st->buff[param_byte_idx] + (uint16_t)(com_st->buff[BODY_REQED_STATUS_VALUE_L] << 8));//HL逆?
                break;
            default:
                com_st->receive_status = RECEIVE_FAILED;
                break;
        }
    }
}

inline static void parse_command_crc( COM_MP_TO_SV* mp_sv )
{
    mp_sv->crc_err = 0x01;
    if ( mp_sv->received_byte_num != mp_sv->packet_len ) {
        // something is wrong
        return;
    }
    mp_sv->crc = mp_sv->buff[mp_sv->received_byte_num-1];

    if ( mp_sv->crc == calc_crc( mp_sv->buff, mp_sv->packet_len-1 ) ) {
        mp_sv->crc_err = 0x00;
    }
}

inline static void parse_command_crc_multi( COM_STATUS* com_st )
{
    com_st->crc_err = 0x01;
    if ( com_st->received_byte_num != com_st->packet_len ) {
        // something is wrong
        return;
    }
    com_st->crc = com_st->buff[com_st->received_byte_num-1];

    if ( com_st->crc == calc_crc( com_st->buff, com_st->packet_len-1 ) ) {
        com_st->crc_err = 0x00;
    }
}


/**************************************
 バスに接続されたSV通信の受信対応に拡張
***************************************/
void receive_command_parse_multi(void)
{
    while ( !is_queue_empty( &comm_receive_queue ) ) {
        switch ( receive_byte_multi( &_com_st[_com_st_current_write] ) ) {
            case NO_RECEIVING:
                break;
            case HEADER_RECEIVING:
                parse_command_header_multi( &_com_st[_com_st_current_write] );
                break;
            case BODY_RECEIVING:
                parse_command_body_multi( &_com_st[_com_st_current_write] );
                break;
            case RECEIVE_COMPLETED:
                parse_command_crc_multi( &_com_st[_com_st_current_write] );
                break;
            case RECEIVE_ABORTED:
                // 間に合ってないかも
                return;  // 以後の処理を中断する
            case RECEIVE_FAILED:
            default:
                break;
        }

        if ( _com_st[_com_st_current_write].receive_status == RECEIVE_COMPLETED ) {
            // CRCエラーが出ていたら失敗扱い
            if ( _com_st[_com_st_current_write].crc_err ) {
                _com_st[_com_st_current_write].receive_status = RECEIVE_FAILED;
                _com_st[_com_st_current_write].receive_buff_remained = 0x00;
            }
            else {
                _com_st[_com_st_current_write].receive_buff_remained = 0x01;
            }

            // 先のparse結果の引き取りがされていれば面を入れ替え
            if ( !(_com_st[_com_st_current_read].receive_buff_remained) ) {
                _com_st_current_write = 1-_com_st_current_write;
                _com_st_current_read = 1-_com_st_current_read;
            }
            else {
                // 引き取りが間に合ってないので次も同じ面に書く
            }
        }
    }
}


void parser_multi_mp_sv(COM_STATUS * com_st)
{
    //とりあえず0
    com_st->receive_buff_remained = 0;
}

