akinakano/RP2040_battery_control/CM7/App/Src/comm_mpsv.c
uint16_t dbg_cnt[12] = {0};
void parser_multi_sv_mp(COM_STATUS * com_st)
{
    uint8_t sv_id=0;
    // SVのIDに応じて処理変更する
    switch(com_st->sending_sv_id){
        case 0x01://SV1
            sv_id = SV2_FL;
            dbg_cnt[0]++;
            sv_data[0].cnt++;
            break;
#if (COMM_SV_NUM >= 2)
        case 0x02://SV2
            sv_id = SV1_FR;
            dbg_cnt[1]++;
            sv_data[1].cnt++;
            break;
#endif
#if (COMM_SV_NUM >= 3)
        case 0x03://SV3
            sv_id = SV3_HR;
            dbg_cnt[2]++;
            sv_data[2].cnt++;
            break;
#endif
#if (COMM_SV_NUM >= 4)
        case 0x04://SV4
            sv_id = SV4_HL;
            dbg_cnt[3]++;
            sv_data[3].cnt++;
            break;
#endif
        default:
            break;
    }

    //q軸電流
    //16bit -25A~+25A
    //link[link_id].current = (float)com_st->iq_current * 25.0f / 32767.0f;
    //20240521現在、これはsrc電流が返ってきている。
    sv_data[sv_id].iq = com_st->iq_current;

    //MR角度
    //16bit 360deg
    //link[link_id].q_mr = (float)com_st->pos_mr * 180.0f / 32767.0f;
    sv_data[sv_id].mr = com_st->pos_mr;

    //HALL角度
    //16bit 360deg
    //link[link_id].q_hall = (float)com_st->pos_hall * 180.0f / 32767.0f;
    //20240521現在、これは機械角速度(response)が返ってきている[Hz]。
    sv_data[sv_id].hall = com_st->pos_hall;

    //温度
    //20240521現在、これは機械角速度(command)が返ってきている[Hz]。
    sv_data[sv_id].req = com_st->reqed_status_value;

    //電源電圧(電源電流箇所代用)
    //20240521現在、これは電源電圧が返ってきている[0.1V]
    sv_data[sv_id].vdc = com_st->source_current;

    //primary status
    sv_data[sv_id].current_state = (com_st->primary_status & 3);

    //crcエラー
    sv_data[sv_id].crc_err = com_st->crc_err;

    //0にする
    com_st->receive_buff_remained = 0;
}

void parser_multi(COM_STATUS * com_st)
{
    int16_t max_count_crc_err = 10;
    static int16_t count_continuous_crc_err = 0;

    if (com_st->crc_err != 1) {
        if (com_st->direction == MP_TO_SV) {
            parser_multi_mp_sv(com_st);
        } else {
            parser_multi_sv_mp(com_st);
        }
        count_continuous_crc_err = 0;
    } else {
        // CRCエラー起きたけどバッファを空にする(次の受信をするため)
        com_st->receive_buff_remained = 0;
        count_continuous_crc_err ++;
    }

    state_mcn.err_info_cnt = count_continuous_crc_err;
    //エラーが連続したら落とす
    if(count_continuous_crc_err >= max_count_crc_err){
        //mc_state.state = MC_STATE_EMERGENCY;
    }
}

void pack_2Byte_data(uint8_t * buff, int16_t _data)
{
    if (_data < 0) {
        //_data = SMC_F16 + _data;
        _data = 65536 + _data;
    }
    buff[1] = _data % 256;
    buff[0] = (_data - buff[1]) >> 8;
}

void send_mode_broadcast_data(COM_MP_TO_SV * mp_sv, uint8_t sv_num, uint8_t mode[], uint8_t req_status)
{
    //モードコマンド設定
    mp_sv->command = 0x01;
    mp_sv->tar_id = 0x00;
    mp_sv->packet_len = 0x05 + sv_num;
    mp_sv->req_status = req_status;
    for(int i = 0; i < sv_num; i++){
        mp_sv->param_mode[i] = mode[i];
    }

    //送信バッファに詰める
    mp_sv->buff[HEADER_COMMAND_ID] = mp_sv->command;
    mp_sv->buff[HEADER_TARGET_ID] = mp_sv->tar_id;
    mp_sv->buff[HEADER_PACKET_LEN] = mp_sv->packet_len;
    mp_sv->buff[HEADER_REQ_STATUS] = mp_sv->req_status;
    for(int i = 0; i < sv_num; i++){
        mp_sv->buff[HEADER_REQ_STATUS + 1 + i] = mode[i];
    }

    mp_sv->crc = calc_crc(mp_sv->buff, 4 + sv_num + 1 - 1);
    mp_sv->buff[HEADER_REQ_STATUS + sv_num + 1] = mp_sv->crc;


    //送信
    USART_TypeDef *UARTx = SCI_COMM_UART;
    uint32_t timeout_count = 0;
    const uint32_t TIMEOUT_COUNT_MAX = 10000;

    // TE (Transmit Enable)をセットすることでidleフレームを送信
    UARTx->CR1 |= USART_CR1_TE;

    // データ長だけTDRに書き込む。データはFIFOに積まれる。
    for (int i = 0; i < 5 + sv_num; i++) {
        // while (UART_FLAG_TXFNF != ((UARTx->ISR) & UART_FLAG_TXFNF)) {
        while ( is_usart_txFIFO_full(UARTx->ISR) ) {
            timeout_count++;
            if ( timeout_count > TIMEOUT_COUNT_MAX ) {
                timeout_count = 0;
                break;
            }
        }
        UARTx->TDR = mp_sv->buff[i];
    }

    // 全てのデータをTDRに書いたらTC (Transmit Complete)が1になるまで待つ
    timeout_count = 0;
    while (!is_transmit_completed(UARTx->ISR)) {
        timeout_count++;
        if ( timeout_count > TIMEOUT_COUNT_MAX) {
            break;
        }
    }

    // TE をクリアすることで送信を停止
    UARTx->CR1 &= (~USART_CR1_TE);
}

void send_cmd_broadcast_data(COM_MP_TO_SV * mp_sv, uint8_t cmd, uint8_t sv_num, int16_t param[], uint8_t req_status)
{
    //制御コマンド設定
    mp_sv->command = cmd;
    mp_sv->tar_id = 0x00;
    mp_sv->packet_len = 0x05 + sv_num * 2;
    mp_sv->req_status = req_status;
    for(int i = 0; i < sv_num; i++){
        if(cmd == FORCE_CNTRL_ALL){
            mp_sv->force[i] = param[i];
        }else if(cmd == POS_CNTRL_ALL){
            mp_sv->pos[i] = param[i];
        }else if(cmd == VEL_CNTRL_ALL){
            mp_sv->vel[i] = param[i];
        }else if(cmd == ACC_CNTRL_ALL){
            mp_sv->force[i] = param[i];
        }
    }

    //送信バッファに詰める
    mp_sv->buff[HEADER_COMMAND_ID] = mp_sv->command;
    mp_sv->buff[HEADER_TARGET_ID] = mp_sv->tar_id;
    mp_sv->buff[HEADER_PACKET_LEN] = mp_sv->packet_len;
    mp_sv->buff[HEADER_REQ_STATUS] = mp_sv->req_status;
    for(int i = 0; i < sv_num; i++){
        if(cmd == FORCE_CNTRL_ALL){
            pack_2Byte_data(&mp_sv->buff[HEADER_REQ_STATUS + 1 + 2 * i], mp_sv->force[i]);
        }else if(cmd == POS_CNTRL_ALL){
            pack_2Byte_data(&mp_sv->buff[HEADER_REQ_STATUS + 1 + 2 * i], mp_sv->pos[i]);
        }else if(cmd == VEL_CNTRL_ALL){
            pack_2Byte_data(&mp_sv->buff[HEADER_REQ_STATUS + 1 + 2 * i], mp_sv->vel[i]);
        }else if(cmd == ACC_CNTRL_ALL){
            pack_2Byte_data(&mp_sv->buff[HEADER_REQ_STATUS + 1 + 2 * i], mp_sv->force[i]);
        }
    }

    mp_sv->crc = calc_crc(mp_sv->buff, 4 + sv_num * 2 + 1 - 1);
    mp_sv->buff[HEADER_REQ_STATUS + sv_num * 2 + 1] = mp_sv->crc;


    //送信
    USART_TypeDef *UARTx = SCI_COMM_UART;
    uint32_t timeout_count = 0;
    const uint32_t TIMEOUT_COUNT_MAX = 10000;

    // TE (Transmit Enable)をセットすることでidleフレームを送信
    UARTx->CR1 |= USART_CR1_TE;

    // データ長だけTDRに書き込む。データはFIFOに積まれる。
    for (int i = 0; i < 5 + sv_num * 2; i++) {
        // while (UART_FLAG_TXFNF != ((UARTx->ISR) & UART_FLAG_TXFNF)) {
        while ( is_usart_txFIFO_full(UARTx->ISR) ) {
            timeout_count++;
            if ( timeout_count > TIMEOUT_COUNT_MAX ) {
                timeout_count = 0;
                break;
            }
        }
        UARTx->TDR = mp_sv->buff[i];
    }

    // 全てのデータをTDRに書いたらTC (Transmit Complete)が1になるまで待つ
    timeout_count = 0;
    while (!is_transmit_completed(UARTx->ISR)) {
        timeout_count++;
        if ( timeout_count > TIMEOUT_COUNT_MAX) {
            break;
        }
    }

    // TE をクリアすることで送信を停止
    UARTx->CR1 &= (~USART_CR1_TE);
}

void send_status( COM_SV_TO_MP * sv_mp )
{
    USART_TypeDef *UARTx = SCI_COMM_UART;
    uint32_t timeout_count = 0;
    const uint32_t TIMEOUT_COUNT_MAX = 10000;

    // TE (Transmit Enable)をセットすることでidleフレームを送信
    UARTx->CR1 |= USART_CR1_TE;

    // データ長だけTDRに書き込む。データはFIFOに積まれる。
    for (int i = 0; i < SEND_STATUS_LEN; i++) {
        // while (UART_FLAG_TXFNF != ((UARTx->ISR) & UART_FLAG_TXFNF)) {
        while ( is_usart_txFIFO_full(UARTx->ISR) ) {
            timeout_count++;
            if ( timeout_count > TIMEOUT_COUNT_MAX ) {
                timeout_count = 0;
                break;
            }
        }
        UARTx->TDR = sv_mp->buff[i];
    }

    // 全てのデータをTDRに書いたらTC (Transmit Complete)が1になるまで待つ
    timeout_count = 0;
    while (!is_transmit_completed(UARTx->ISR)) {
        timeout_count++;
        if ( timeout_count > TIMEOUT_COUNT_MAX) {
            break;
        }
    }

    sv_mp->send_buff_remained = 0;

    // TE をクリアすることで送信を停止
    UARTx->CR1 &= (~USART_CR1_TE);
}


/****************************************************************
  上流通信でRXを受信後にパースするための低優先度のソフト割り込み処理
****************************************************************/
COM_STATUS dbg_com[3];
void MP_COMM_SOFT_IrqHandler(void)
{

    // Clear EXTI0 interrupt request
    EXTI->PR1 |= EXTI_PR1_PR0;

    // 低優先度のソフト割り込みの中で受信バッファから値を抽出
    // 受信完了したらreceive_buff_remainedをセット.Readのreceive_buff_remainedがクリアされていれば面を入れ替え
    receive_command_parse_multi();

